pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes_set_current_address.h
//---------------------------------------------------------------------------*
//                                                                           *
//         File 'pic18_intermediate_classes_set_current_address.h'           *
//                        Generated by version 2.4.5                         *
//                      june 18th, 2013, at 14h54'11"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_intermediate_classes_set_current_address_ENTITIES_DEFINED
#define pic18_intermediate_classes_set_current_address_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_intermediate_classes_instruction_length.h"
#include "pic18_intermediate_classes.h"
#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*
//                                                                           *
//    Category method '@pic18_intermediate_instruction setCurrentAddress'    *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                      GALGAS_uint & ioArgument0,
                                                                                                      C_Compiler * inCompiler
                                                                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_setCurrentAddress (const PMSInt32 inClassIndex,
                                            categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_setCurrentAddress inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_setCurrentAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                           GALGAS_uint & io_ioCurrentAddress,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
